backwardStep_laminar/system/pressureCoefficient
    type            pressure;
    libs            (fieldFunctionObjects);

    writeControl    writeTime;

    mode            staticCoeff;

    result          cp;

    rho             rhoInf;
    rhoInf          1;
    pInf            0;
    UInf            (0.1968 0 0);